==================
Basic Function
==================

int f() { return 0; }
---
(source_file
    (module
        (func_declaration
            (scalar)
            (identifier)
            (parameters)
            (function_body
                (block_statement
                    (return_statement (expression (int_literal))
                    )
                )
            )
        )
    )
)

==================
Single Parameter Function
==================

int f(int c) { return c; }
---
(source_file
    (module
        (func_declaration
            (scalar)
            (identifier)
            (parameters
                (parameter (scalar) (var_declarator (identifier))))
            (function_body
                (block_statement
                    (return_statement (expression (identifier)))))
        )
    )
)

==================
Var Args Parameter Function
==================

int f(int c, ...) { return c; }
---
(source_file
    (module
        (func_declaration
            (scalar)
            (identifier)
            (parameters
                (parameter
                    (scalar)
                    (var_declarator (identifier))
                )
                (ellipses)
            )
            (function_body
                (block_statement
                    (return_statement
                        (expression (identifier))
                    )
                )
            )
        )
    )
)

==================
Var Args Only Function
==================

int f(...) { return c; }
---
(source_file
    (module
        (func_declaration
            (scalar)
            (identifier)
            (parameters
                (ellipses)
            )
            (function_body
                (block_statement
                    (return_statement
                        (expression (identifier))
                    )
                )
            )
        )
    )
)

==================
Var Args Type-Safe Function
==================

int f(int...) { return c; }
---
(source_file (module
    (func_declaration
        (scalar)
        (identifier)
        (parameters (parameter (type (scalar)) (ellipses)))
        (function_body (block_statement (return_statement (expression (identifier))))))
    )
)

==================
Member Function Attributes
==================

int f(int a, int b) @safe pure @myattr { return a+b; }
---
(source_file
    (module
        (func_declaration
            (scalar)
            (identifier)
            (parameters
                (parameter (scalar) (var_declarator (identifier)))
                (parameter (scalar) (var_declarator (identifier)))
            )
            (member_function_attribute
                (at_attribute))
            (member_function_attribute)
            (member_function_attribute
                (at_attribute (user_defined_attribute (identifier))))
            (function_body
                (block_statement
                    (return_statement
                        (expression (add_expression (identifier) (identifier))))
                )
            )
        )
    )
)
